//以下为4个嫌疑犯的供词:
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//int main()
//{
//	//猜凶手
//	int arr[4] = { 0 };//假设全部不是凶手
//	int i = 0;
//	for (i = 0; i < 4; i++)
//	{
//		arr[i] = 1;//假设是凶手
//		if (((arr[0] != 1) + (arr[2] == 1) + (arr[3] == 1) + (arr[3] != 1)) == 3)
//		{
//			break;//满足三个为真则跳出循环
//		}
//		arr[i] = 0;//不满足则不是凶手，置0
//	}
//	printf("凶手是：%c\n", i + 'A');//数字0 1 2 3加字符A得到对应的字符A B C D
//	return 0;
//}

////1 0 0 0 0
////1 1 0 0 0
////1 2 1 0 0
////1 3 3 1 0
////1 4 5 4 1
//
//int main()
//{
//	//杨辉三角
//	int arr[10][10] = { 1 };
//	int i = 0;
//	int j = 0;
//	for (i = 1; i < 10; i++)
//	{
//		arr[i][0] = 1;
//		for (j = 1; j < 10; j++)
//		{
//			arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		for (j =0; j <= i; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}  
//		printf("\n");
//	}
//	return 0;
//}